In [2]:
import numpy as np
import pandas as pd

s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5, 6], index=['f', 'g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [3]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [4]:
pd.concat([s1, s2, s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [5]:
pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [6]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
display(df1)
display(df2)

          a         b         c         d
0 -0.503075  0.578289  0.622156  0.363164
1  0.176412  0.021681 -1.565021 -0.645985
2  0.491176  0.595226  0.124892 -0.877708

          b         d         a
0 -0.851719  0.000865 -0.504624
1 -0.875170  0.126054 -0.384553

In [11]:
pd.concat([df1,df2],keys=['10_1','10_2'])

               a         b         c         d
10_1 0 -0.503075  0.578289  0.622156  0.363164
     1  0.176412  0.021681 -1.565021 -0.645985
     2  0.491176  0.595226  0.124892 -0.877708
10_2 0 -0.504624 -0.851719       NaN  0.000865
     1 -0.384553 -0.875170       NaN  0.126054

In [12]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0 -0.503075  0.578289  0.622156  0.363164
1  0.176412  0.021681 -1.565021 -0.645985
2  0.491176  0.595226  0.124892 -0.877708
3 -0.504624 -0.851719       NaN  0.000865
4 -0.384553 -0.875170       NaN  0.126054